test/logs/performance_20260609_002013.log
Log: /home/ubuntu/HTTP-RPC/test/logs/performance_20260609_002013.log


=== 0. 预热 (Warmup — 不计入结果) ===
[OK] Cookie ready
  预热 gRPC/Redis 连接池... done
[OK] Warmup complete

=== 1. 单请求延迟 (RTT) ===
  Login                0.010923s
  No Cookie (401)      0.015705s
  Sheet List (cached)  0.012872s
  Sheet List (cached)  0.018707s
  Health Check         0.013705s

=== 2. 并发 (10 c, xargs -P 精确同步) ===
  Health (no auth)          P50=69.234000ms  P95=86.685000ms  P99=86.685000ms  max=86.685000ms
  Sheet List                P50=67.352000ms  P95=90.231000ms  P99=90.231000ms  max=90.231000ms
  Sheet Get                 P50=27.036000ms  P95=39.170000ms  P99=39.170000ms  max=39.170000ms

=== 3. Cache-Aside 命中率 ===
  Redis 命中    0/20
  MySQL 回源    1/20
  首次写入      19/20

=== 4. 1MB 文件上传 ===
  Upload 1MB           0.527059s

=== 5. 负载测试 (300 req, 10c, curl cold-connect) ===
  总耗时           2893ms
  吞吐量 (curl)    103.6 req/s (cold-connect; ab keep-alive 会更高)

=== 6. 写入压测 (10x 创建→获取→更新→删除 循环) ===
  40 ops 总耗时        1565ms (avg 39ms/op)
  写操作成功率        10/10
  写操作 P50/P95/P99  P50=103000.000000ms  P95=629000.000000ms  P99=629000.000000ms

=== 7. ab 权威 QPS (keep-alive, 1000 req x 10c) ===
  [健康检查基线 — 纯网关吞吐]
Failed requests:        0
Requests per second:    3468.72 [#/sec] (mean)
  50%      3
  95%      4
  99%      7
 100%     28 (longest request)

  [Sheet List — 鉴权+gRPC+Redis 完整链路]
Failed requests:        915
Non-2xx responses:      915
Requests per second:    5706.04 [#/sec] (mean)
  50%      1
  95%      5
  99%     12
 100%     39 (longest request)

=== 8. wrk2 恒定速率压测 (constant-rate, 30s, 10c, 200req/s) ===
  [wrk (非 constant-rate) 30s, 10c]
    Latency     2.65ms    1.14ms  22.75ms   74.01%
  Latency Distribution
     50%    2.42ms
     90%    4.14ms
     99%    6.33ms
Requests/sec:   3015.05

  [混合负载 70%list/20%get/10%create — 需要 wrk2]
Running 30s test @ https://localhost/api/sheets
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.02ms  613.99us  11.20ms   81.88%
    Req/Sec     1.97k   474.70     2.91k    58.00%
  Latency Distribution
     50%    0.87ms
     75%    1.24ms
     90%    1.72ms
     99%    3.29ms
  235975 requests in 30.03s, 50.99MB read
  Non-2xx or 3xx responses: 235975
Requests/sec:   7858.37
Transfer/sec:      1.70MB
------------------------------
Profile:  70% list / 20% get / 10% create
Requests: 235975 (7858.4 req/s)
Errors:   connect=0 read=0 write=0 status=235975 timeout=0
Latency:  avg=1.02ms  p50=0.87ms  p90=1.72ms  p99=3.29ms  p99.9=5.55ms  max=11.20ms

==========================================
  Performance Test Complete
  curl 测量冷连接延迟 | ab 测量 keep-alive QPS | wrk2 测量恒定速率
==========================================